bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
/*
plug pinout at end with holes facing you: https://learn.adafruit.com/system/assets/assets/000/023/826/medium800/led_matrix_plug2.png?1426392350
____________________________
|GND	STB	D	B	GND	G1	GND	GO|
|/OE	CLK	C	A	B1	R1	B0	R0|
¯¯¯¯¯¯¯¯¯¯¯¯¯|_|¯¯¯¯¯¯¯¯¯¯¯¯

place board with silkscreen upright facing you, then flip board horizontally (left side to right side)
pixels shift in from right to left

top 16 rows (clock in 32 pixels)
R0	PC3
G0	PC8
B0	PC11

bottom 16 rows (clock in 32 pixels)
R1	PC12
G1	PC13
B1	PC14

4 bit selector selects the 2 active rows for the top and bottom (eg 0 selects rows 0 and 16). These are asynchronous and alters the row without a clock or latch
A		PE2
B		PE3
C		PE4
D		PE5

CLK	PD4		clock the data into the latches for both top and bottom sections
STB	PD5	latches the data into the leds for both top and bottom sections

output enable turns the currently latched LEDs on or off and is active low
/OE PE6 for both top and bottom sections

unlabled pins on this port connect to ground

free pins:
PA0 (if the user button is not used), PA5, PA9, PA10
PB4, PB7
PC15
PD2, PD7
PF6
PG2, PG3, PG13 (green led), PG14 (red led)
*/

#include "main.h"
#include "HelperFunctions.h"
#include "registers.h"
#include "STM32F4-lib.h"
#include "32x32_RGB_LED.h"
#include <math.h>
#include <stdarg.h>

/******************************************************
 *              Font 7x11(English)                    *
 * -ASCII fonts from 0x20 ~ 0x7F(DEC 32 ~ 126)     	  *
 *   bits 5 (bottom) to 15 (top) in the y direction   *
 *	      7 words=7 lines in the x direction		  *
 ******************************************************/
const unsigned short LEDascii_7x11[95][14] = {                                                       
	{0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x001F}, //0x0020 space
	{0x0000, 0x07C0, 0xDFE0, 0xDFE0, 0x07C0, 0x0000, 0x001F}, //0x0021 !
	{0x0000, 0x00E0, 0x00E0, 0x0000, 0x00E0, 0x00E0, 0x001F}, //0x0022 "
	{0x0000, 0x1B00, 0x7FC0, 0x1B00, 0x7FC0, 0x1B00, 0x001F}, //0x0023 #
	{0x1300, 0x2780, 0x2480, 0x7FC0, 0x2480, 0x3880, 0x191F}, //0x0024 $
	{0x3080, 0x1940, 0x2D40, 0x5680, 0x5300, 0x2180, 0x001F}, //0x0025 %
	{0x3800, 0x7D80, 0x47C0, 0x5E40, 0x7BC0, 0x2180, 0x581F}, //0x0026 &
	{0x0000, 0x0000, 0x00E0, 0x00E0, 0x0000, 0x0000, 0x001F}, //0x0027 '
	{0x0000, 0x0000, 0x3F80, 0x7FC0, 0xC060, 0x8020, 0x001F}, //0x0028 (
	{0x0000, 0x8020, 0xC060, 0x7FC0, 0x3F80, 0x0000, 0x001F}, //0x0029 )
	{0x0000, 0x2480, 0x3F80, 0x0E00, 0x3F80, 0x2480, 0x001F}, //0x002A *
	{0x0400, 0x0400, 0x1F00, 0x1F00, 0x0400, 0x0400, 0x001F}, //0x002B +
	{0x0000, 0x8000, 0xE000, 0x6000, 0x0000, 0x0000, 0x001F}, //0x002C ,
	{0x0400, 0x0400, 0x0400, 0x0400, 0x0400, 0x0400, 0x001F}, //0x002D -
	{0x0000, 0x0000, 0xC000, 0xC000, 0x0000, 0x0000, 0x001F}, //0x002E .
	{0xC000, 0xF000, 0x3C00, 0x0F00, 0x03C0, 0x00E0, 0x003F}, //0x002F /
	{0x7FC0, 0xFFE0, 0x8020, 0x8020, 0x8020, 0xFFE0, 0x7FDF}, //0x0030 0
	{0x0000, 0x8080, 0x80C0, 0xFFE0, 0xFFE0, 0x8000, 0x001F}, //0x0031 1
	{0xE0C0, 0xF0E0, 0x9820, 0x8C20, 0x8420, 0x87E0, 0x83DF}, //0x0032 2
	{0x60C0, 0xE0E0, 0x8420, 0x8420, 0x8420, 0xFFE0, 0x7BDF}, //0x0033 3
	{0x3800, 0x3E00, 0x2780, 0x21E0, 0xFFE0, 0xFFE0, 0x201F}, //0x0034 4
	{0x83E0, 0x83E0, 0x8220, 0x8220, 0xC220, 0x7E20, 0x3C3F}, //0x0035 5
	{0x7F00, 0xFFC0, 0x8260, 0x8220, 0x8220, 0xFE20, 0x7C3F}, //0x0036 6
	{0x0020, 0x0020, 0xE020, 0xFC20, 0x1F20, 0x03E0, 0x00FF}, //0x0037 7
	{0x7BC0, 0xFFE0, 0x8620, 0x8620, 0x8C20, 0xFFE0, 0x7BDF}, //0x0038 8
	{0x03C0, 0x87E0, 0x8420, 0xC420, 0x6420, 0x3FE0, 0x1FDF}, //0x0039 9
	{0x0000, 0x0000, 0x3180, 0x3180, 0x3180, 0x0000, 0x001F}, //0x003A :
	{0x0000, 0x0000, 0xB180, 0xF180, 0x7180, 0x0000, 0x001F}, //0x003B ;
	{0x0400, 0x0E00, 0x1B00, 0x3180, 0x60C0, 0xC060, 0x803F}, //0x003C <
	{0x0A00, 0x0A00, 0x0A00, 0x0A00, 0x0A00, 0x0A00, 0x0A1F}, //0x003D =
	{0x8020, 0xC060, 0x60C0, 0x3180, 0x1B00, 0x0E00, 0x041F}, //0x003E >
	{0x01C0, 0x01E0, 0x0020, 0xD820, 0xDC20, 0x07E0, 0x03DF}, //0x003F ?
	{0x7F40, 0x8320, 0x8320, 0xFF20, 0x8060, 0xFFE0, 0x7FDF}, //0x0040 @
	{0xFF00, 0xFF80, 0x08C0, 0x0860, 0x08C0, 0xFF80, 0xFF1F}, //0x0041 A
	{0xFFE0, 0xFFE0, 0x8420, 0x8420, 0x8420, 0xFFE0, 0x7BDF}, //0x0042 B
	{0x7FC0, 0xFFE0, 0x8020, 0x8020, 0x8020, 0xE0E0, 0x60DF}, //0x0043 C
	{0xFFE0, 0xFFE0, 0x8020, 0x8020, 0xC060, 0x7FC0, 0x3F9F}, //0x0044 D
	{0xFFE0, 0xFFE0, 0x8420, 0x8420, 0x8420, 0x8420, 0x803F}, //0x0045 E
	{0xFFE0, 0xFFE0, 0x0420, 0x0420, 0x0420, 0x0420, 0x003F}, //0x0046 F
	{0x7FC0, 0xFFE0, 0x8020, 0x8020, 0x8820, 0xF8E0, 0xF8DF}, //0x0047 G
	{0xFFE0, 0xFFE0, 0x0400, 0x0400, 0x0400, 0xFFE0, 0xFFFF}, //0x0048 H
	{0x0000, 0x8020, 0xFFE0, 0xFFE0, 0x8020, 0x0000, 0x001F}, //0x0049 I
	{0x6000, 0xE000, 0x8000, 0x8000, 0x8000, 0xFFE0, 0x7FFF}, //0x004A J
	{0xFFE0, 0xFFE0, 0x0400, 0x1F00, 0x7BC0, 0xE0E0, 0x803F}, //0x004B K
	{0xFFE0, 0xFFE0, 0x8000, 0x8000, 0x8000, 0x8000, 0x801F}, //0x004C L
	{0xFFE0, 0xFFE0, 0x0080, 0x0700, 0x0080, 0xFFE0, 0xFFFF}, //0x004D M
	{0xFFE0, 0xFFE0, 0x0380, 0x0E00, 0x3800, 0xFFE0, 0xFFFF}, //0x004E N
	{0x7FC0, 0xFFE0, 0x8020, 0x8020, 0x8020, 0xFFE0, 0x7FDF}, //0x004F O
	{0xFFE0, 0xFFE0, 0x0420, 0x0420, 0x0420, 0x07E0, 0x03DF}, //0x0050 P
	{0x7FC0, 0xFFE0, 0x9020, 0xB020, 0xE020, 0x7FE0, 0xFFDF}, //0x0051 Q
	{0xFFE0, 0xFFE0, 0x0420, 0x0420, 0x0C20, 0xFFE0, 0xF3DF}, //0x0052 R
	{0x43C0, 0xC7E0, 0x8620, 0x8420, 0x8C20, 0xFC60, 0x785F}, //0x0053 S
	{0x0020, 0x0020, 0xFFE0, 0xFFE0, 0x0020, 0x0020, 0x001F}, //0x0054 T
	{0x7FE0, 0xFFE0, 0x8000, 0x8000, 0x8000, 0xFFE0, 0x7FFF}, //0x0055 U
	{0x1FE0, 0x3FE0, 0x6000, 0xC000, 0x6000, 0x3FE0, 0x1FFF}, //0x0056 V
	{0x1FE0, 0xFFE0, 0xE000, 0x1C00, 0xE000, 0xFFE0, 0x1FFF}, //0x0057 W
	{0xC060, 0xF1E0, 0x3F80, 0x0E00, 0x3F80, 0xF1E0, 0xC07F}, //0x0058 X
	{0x03E0, 0x07E0, 0xFC00, 0xFC00, 0x07E0, 0x03E0, 0x001F}, //0x0059 Y
	{0xC020, 0xF020, 0xBC20, 0x8F20, 0x83A0, 0x80E0, 0x807F}, //0x005A Z
	{0x0000, 0xFFE0, 0xFFE0, 0x8020, 0x8020, 0x8020, 0x001F}, //0x005B [
	{0x0020, 0x00E0, 0x03C0, 0x0F00, 0x3C00, 0xF000, 0xC01F}, //0x005C '\'
	{0x0000, 0x8020, 0x8020, 0x8020, 0xFFE0, 0xFFE0, 0x001F}, //0x005D ]
	{0x0080, 0x00C0, 0x0060, 0x0060, 0x00C0, 0x0080, 0x001F}, //0x005E ^
	{0x8000, 0x8000, 0x8000, 0x8000, 0x8000, 0x8000, 0x801F}, //0x005F _
	{0x0000, 0x0000, 0x0020, 0x0060, 0x00E0, 0x0080, 0x001F}, //0x0060 `
	{0x7000, 0xF900, 0x8900, 0x8900, 0x8900, 0xFF00, 0xFE1F}, //0x0061 a
	{0xFFE0, 0xFFE0, 0x8100, 0x8100, 0x8100, 0xFF00, 0x7E1F}, //0x0062 b
	{0x7E00, 0xFF00, 0x8100, 0x8100, 0x8100, 0xC300, 0x421F}, //0x0063 c
	{0x7E00, 0xFF00, 0x8100, 0x8100, 0x8100, 0xFFE0, 0xFFFF}, //0x0064 d
	{0x7E00, 0xFF00, 0x9100, 0x9100, 0x9100, 0x9F00, 0x5E1F}, //0x0065 e
	{0x0400, 0xFFC0, 0xFFE0, 0x0420, 0x0420, 0x0420, 0x001F}, //0x0066 f
	{0x9E00, 0xBF00, 0xA100, 0xA100, 0xA100, 0xFF00, 0x7F1F}, //0x0067 g
	{0xFFE0, 0xFFE0, 0x0100, 0x0100, 0x0100, 0xFF00, 0xFE1F}, //0x0068 h
	{0x8100, 0x8100, 0xFF60, 0xFF60, 0x8000, 0x8000, 0x001F}, //0x0069 i
	{0x8000, 0x8100, 0x8100, 0x8100, 0xFF60, 0x7F60, 0x001F}, //0x006A j
	{0xFFE0, 0xFFE0, 0x1800, 0x3C00, 0x6600, 0xC300, 0xC11F}, //0x006B k
	{0x8020, 0x8020, 0xFFE0, 0xFFE0, 0x8000, 0x8000, 0x001F}, //0x006C l
	{0xFF00, 0xFF00, 0x0100, 0x3F00, 0x0100, 0xFF00, 0xFE1F}, //0x006D m
	{0xFF00, 0xFF00, 0x0100, 0x0100, 0x0100, 0xFF00, 0xFE1F}, //0x006E n
	{0x7E00, 0xFF00, 0x8100, 0x8100, 0x8100, 0xFF00, 0x7E1F}, //0x006F o
	{0xFF00, 0xFF00, 0x2100, 0x2100, 0x2100, 0x3F00, 0x1E1F}, //0x0070 p
	{0x1E00, 0x3F00, 0x2100, 0x2100, 0x2100, 0xFF00, 0xFE1F}, //0x0071 q
	{0x0100, 0xFF00, 0xFF00, 0x0400, 0x0200, 0x0300, 0x031F}, //0x0072 r
	{0x8E00, 0x9F00, 0x9900, 0x9900, 0x9900, 0xF900, 0x711F}, //0x0073 s
	{0x0100, 0x0100, 0x7FC0, 0xFFC0, 0x8100, 0x8100, 0x811F}, //0x0074 t
	{0x7F00, 0xFF00, 0x8000, 0x8000, 0x8000, 0xFF00, 0xFF1F}, //0x0075 u
	{0x1F00, 0x3F00, 0x6000, 0xC000, 0x6000, 0x3F00, 0x1F1F}, //0x0076 v
	{0x3F00, 0xFF00, 0xC000, 0x3C00, 0xC000, 0xFF00, 0x3F1F}, //0x0077 w
	{0xE300, 0xF700, 0x1C00, 0x1C00, 0x1C00, 0xF700, 0xE31F}, //0x0078 x
	{0x8F00, 0x9F00, 0x9000, 0x9000, 0x9000, 0xFF00, 0x7F1F}, //0x0079 y
	{0xC100, 0xE100, 0xB100, 0x9900, 0x8D00, 0x8700, 0x831F}, //0x007A z
	{0x0000, 0x0400, 0x7FC0, 0xE0E0, 0x8020, 0x8000, 0x001F}, //0x007B {
	{0x0000, 0x0000, 0xFFE0, 0xFFE0, 0x0000, 0x0000, 0x001F}, //0x007C |
	{0x0000, 0x8020, 0xE0E0, 0x7FC0, 0x0400, 0x0000, 0x005F}, //0x007D }
	{0x0060, 0x0020, 0x0060, 0x00C0, 0x0080, 0x00C0, 0x005F}};//0x007E ~
	
//details on pxldata table:
//0 to 94 (character start index, 32d to 126d ascii)
//95 to 189 (bytes per character)
//190 to 558 (character graphics bytes)

const unsigned int pxldata[559]={190, 191, 192, 195, 201, 205, 211, 215, 216, 218, 220, 223, 228, 230, 233, 234, 237, 241, 243, 247, 251,
256, 260, 264, 268, 272, 276, 277, 279, 283, 287, 291, 295, 303, 310, 314, 319, 324, 328, 332, 337, 342,
343, 347, 352, 356, 363, 368, 373, 378, 383, 388, 392, 397, 402, 409, 418, 424, 429, 433, 435, 438, 440,
445, 450, 452, 456, 460, 464, 468, 472, 474, 478, 482, 483, 484, 488, 489, 496, 500, 504, 508, 512, 514,
518, 520, 524, 529, 536, 540, 544, 548, 551, 552, 555, 1, 1, 3, 6, 4, 6, 4, 1, 2, 2, 3, 5, 2, 3, 1, 3, 4,
2, 4, 4, 5, 4, 4, 4, 4, 4, 1, 2, 4, 4, 4, 4, 8, 7, 4, 5, 5, 4, 4, 5, 5, 1, 4, 5, 4, 7, 5, 5, 5, 5, 5, 4,
5, 5, 7, 9, 6, 5, 4, 2, 3, 2, 5, 5, 2, 4, 4, 4, 4, 4, 2, 4, 4, 1, 1, 4, 1, 7, 4, 4, 4, 4, 2, 4, 2, 4, 5,
7, 4, 4, 4, 3, 1, 3, 4, 0, 95, 3, 0, 3, 20, 124, 23, 116, 31, 20, 36, 122, 47, 18, 66, 37, 26, 36, 82, 33,
54, 73, 118, 80, 3, 126, 129, 129, 126, 5, 2, 5, 4, 4, 31, 4, 4, 64, 32, 8, 8, 8, 64, 96, 28, 3, 62, 65,
65, 62, 2, 127, 98, 81, 73, 70, 34, 65, 73, 54, 24, 20, 18, 127, 16, 39, 69, 69, 57, 62, 73, 73, 50, 1, 97,
29, 3, 54, 73, 73, 54, 38, 73, 73, 62, 34, 64, 34, 8, 20, 20, 34, 20, 20, 20, 20, 34, 20, 20, 8, 2, 1, 89,
6, 60, 66, 153, 165, 165, 189, 162, 28, 96, 24, 22, 17, 22, 24, 96, 127, 73, 73, 54, 62, 65, 65, 65, 34,
127, 65, 65, 34, 28, 127, 73, 73, 73, 127, 9, 9, 9, 62, 65, 65, 73, 122, 127, 8, 8, 8, 127, 127, 32, 64,
64, 63, 127, 8, 20, 34, 65, 127, 64, 64, 64, 127, 4, 24, 32, 24, 4, 127, 127, 6, 8, 48, 127, 62, 65, 65,
65, 62, 127, 9, 9, 9, 6, 62, 65, 65, 97, 190, 127, 9, 9, 25, 102, 38, 73, 73, 50, 1, 1, 127, 1, 1, 63, 64,
64, 64, 63, 3, 12, 48, 64, 48, 12, 3, 3, 12, 112, 12, 3, 12, 112, 12, 3, 65, 34, 28, 28, 34, 65, 3, 4, 120,
4, 3, 97, 89, 69, 67, 255, 129, 3, 28, 96, 129, 255, 4, 2, 1, 2, 4, 64, 64, 64, 64, 64, 1, 2, 36, 84, 84,
120, 127, 68, 68, 56, 56, 68, 68, 40, 56, 68, 68, 127, 56, 84, 84, 88, 126, 5, 156, 162, 162, 126, 127, 4,
4, 120, 125, 253, 127, 16, 40, 68, 127, 124, 4, 4, 124, 4, 4, 120, 124, 4, 4, 120, 56, 68, 68, 56, 254, 34,
34, 28, 28, 34, 34, 254, 124, 4, 72, 84, 84, 36, 126, 68, 60, 64, 64, 124, 12, 48, 64, 48, 12, 28, 96, 16,
12, 16, 96, 28, 108, 16, 16, 108, 142, 112, 16, 14, 100, 84, 84, 76, 8, 54, 65, 255, 65, 54, 8, 2, 1, 2, 1};

const unsigned int sevsegpxldata[30]=
{
	31,17,31,	//0
	0,0,31,	  	//right aligned 1
	//0,31,0,	//centre aligned 1
	29,21,23, 	//2
	21,21,31, 	//3
	7,4,31,	  	//4
	23,21,29,	//5
	31,21,29, 	//6
	1,1,31,	  	//7
	31,21,31, 	//8
	23,21,31	//9
}; 


void InitRGBLEDMatrix(void)
{
	ConfigPinOnPort(R0Port, R0Pin, 'l');
	ConfigPinOnPort(G0Port, G0Pin, 'l');
	ConfigPinOnPort(B0Port, B0Pin, 'l');
	ConfigPinOnPort(R1Port, R1Pin, 'l');
	ConfigPinOnPort(G1Port, G1Pin, 'l');
	ConfigPinOnPort(B1Port, B1Pin, 'l');
	ConfigPinOnPort(RowSelectAPort, RowSelectAPin, 'l');
	ConfigPinOnPort(RowSelectBPort, RowSelectBPin, 'l');
	ConfigPinOnPort(RowSelectCPort, RowSelectCPin, 'l');
	ConfigPinOnPort(RowSelectDPort, RowSelectDPin, 'l');
	ConfigPinOnPort(CLKPort, CLKPin, 'l');
	ConfigPinOnPort(STBPort, STBPin, 'l');
	ConfigPinOnPort(OEPort, OEPin, 'l');

	StartTimer14(4500-1);	//10Khz
}

void PixelTest(unsigned int colour, unsigned int delayMS)	//top to bottom, right to left
{
	unsigned int x;
	unsigned int y;

	delayMS*=1000;
	
	//top half of screen
	ClearPin(R1Port, R1Pin);
	ClearPin(G1Port, G1Pin);
	ClearPin(B1Port, B1Pin);

	for(y=0;y<16;y++)
	{		
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(x==0)	//put the data into the start of the shift register
			{
				if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
				if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
				if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
			}else	//shift in 0 for the rest
			{
				ClearPin(B0Port, B0Pin);
				ClearPin(G0Port, G0Pin);
				ClearPin(R0Port, R0Pin);
			}
			__asm{ NOP }
			
			SetPin(CLKPort, CLKPin);	//clock high
			waitsys(1);
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
			
			//display every shift
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
