bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
			//select the row
			SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
			__asm{ NOP }
			if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
			if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
			if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
			if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
			__asm{ NOP }
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
			
			waitsys(delayMS);
		}
	}
	
	//bottom half of screen
	ClearPin(R0Port, R0Pin);
	ClearPin(G0Port, G0Pin);
	ClearPin(B0Port, B0Pin);
	
	for(y=0;y<16;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(x==0)	//put the data into the start of the shift register
			{
				if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
				if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
				if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
			}else	//shift in 0 for the rest
			{
				ClearPin(B1Port, B1Pin);
				ClearPin(G1Port, G1Pin);
				ClearPin(R1Port, R1Pin);
			}
			__asm{ NOP }
			__asm{ NOP }
				
			SetPin(CLKPort, CLKPin);	//clock high
			__asm{ NOP }
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
			
			//display every shift
			SetPin(STBPort, STBPin);	//latch high
			__asm{ NOP }
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			//select the row
			SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
			__asm{ NOP }
			if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
			if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
			if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
			if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
			__asm{ NOP }
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
			
			waitsys(delayMS);
		}
	}
}

void LightUpPixel(unsigned int x, unsigned int y, unsigned int colour)
{
	unsigned int i;
	
	x=(LedMatrixWidth-1)-x;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
	if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
	if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
	if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
	__asm{ NOP }
	
	if(y<16)
	{
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
	}else
	{
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
	}
	
	SetPin(CLKPort, CLKPin);	//clock high
	waitsys(1);
	ClearPin(CLKPort, CLKPin);	//clock low
	__asm{ NOP }
	
	if(y<16)
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
	}else
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
	}
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		if(i==x)
		{
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
		}
		
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
}

void LightUpLine(unsigned int y, unsigned int colour)
{
	unsigned int i;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
	if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
	if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
	if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
	__asm{ NOP }
	
	if(y<16)
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }

	}else
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }

	}
	__asm{ NOP }
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	SetPin(STBPort, STBPin);	//latch high
	__asm{ NOP }
	ClearPin(STBPort, STBPin);	//latch low
	__asm{ NOP }
	
	ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
	__asm{ NOP }
}

void LightUpAreaSegmented(unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned int colour)
{
	unsigned int x;
	unsigned int y;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	//limit to top or bottom
	if((y1<16) && (y2>15)){ y2=15; }
	
	//clear the shift registers (top and bottom)
	for(x=0;x<LedMatrixWidth;x++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	if(y1<16)
	{
		if(colour & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
		if(colour & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
		if(colour & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
	}else
	{
		if(colour & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
		if(colour & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
		if(colour & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
	}
	
