bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
	//shift in data
	for(x=x1;x<=x2;x++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	if(y1<16)
	{
		ClearPin(B0Port, B0Pin);
		ClearPin(G0Port, G0Pin);
		ClearPin(R0Port, R0Pin);
	}else
	{
		ClearPin(B1Port, B1Pin);
		ClearPin(G1Port, G1Pin);
		ClearPin(R1Port, R1Pin);
	}
	
	//offset to xstart
		for(x=0;x<x1;x++)
		{
			SetPin(CLKPort, CLKPin);	//clock high
			waitsys(1);
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
		}
	
	//cycle the line over all y lines
	for(y=y1;y<=y2;y++)
	{
		if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		
		if(y==y1)
		{
			SetPin(STBPort, STBPin);	//latch high
			waitsys(1);
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
		}
		
		waitsys(100);
	}
}

void LightUpArea(unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned int colour)
{
	unsigned int tmp;
	
	x1=(LedMatrixWidth-1)-x1;
	x2=(LedMatrixWidth-1)-x2;
	
	//may sure p2 coords are below p1 coords
	if(x1>x2){ tmp=x1; x1=x2; x2=tmp; }
	if(y1>y2){ tmp=y1; y1=y2; y2=tmp; }

	if((y1 & 0x10)==(y2 & 0x10))
	{
		LightUpAreaSegmented(x1, y1, x2, y2, colour);
	}else
	{
		LightUpAreaSegmented(x1, y1, x2, 15, colour);
		LightUpAreaSegmented(x1, 16, x2, y2, colour);
	}
}

void LightLEDScreen(unsigned int colour)
{
	unsigned int i;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	if(colour & 1){ SetPin(B0Port, B0Pin); SetPin(B1Port, B1Pin); }else{ ClearPin(B0Port, B0Pin); ClearPin(B1Port, B1Pin); }
	if(colour & 2){ SetPin(G0Port, G0Pin); SetPin(G1Port, G1Pin); }else{ ClearPin(G0Port, G0Pin); ClearPin(G1Port, G1Pin); }
	if(colour & 4){ SetPin(R0Port, R0Pin); SetPin(R1Port, R1Pin); }else{ ClearPin(R0Port, R0Pin); ClearPin(R1Port, R1Pin); }
	__asm{ NOP }
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
	}
	
	SetPin(STBPort, STBPin);	//latch high
	__asm{ NOP }
	ClearPin(STBPort, STBPin);	//latch low
	__asm{ NOP }
	
	for(i=0;i<16;i++)
	{
		if(i & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(i & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(i & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(i & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		
		ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
		__asm{ NOP }
		
		waitsys(10);
	}
}

void ClearLEDScreen(void)
{
	unsigned int i;
	
	SetPin(OEPort,OEPin);	//active low. leds are ready for display, turn off
	__asm{ NOP }
	
	ClearPin(B0Port, B0Pin);
	ClearPin(G0Port, G0Pin);
	ClearPin(R0Port, R0Pin);
	ClearPin(B1Port, B1Pin);
	ClearPin(G1Port, G1Pin);
	ClearPin(R1Port, R1Pin);
	__asm{ NOP }
	__asm{ NOP }
	
	for(i=0;i<LedMatrixWidth;i++)
	{
		SetPin(CLKPort, CLKPin);	//clock high
		waitsys(1);
		ClearPin(CLKPort, CLKPin);	//clock low
		__asm{ NOP }
		waitsys(1);
	}
	
	SetPin(STBPort, STBPin);	//latch high
	waitsys(1);
	ClearPin(STBPort, STBPin);	//latch low
	__asm{ NOP }
	
	ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
	__asm{ NOP }
}

void DispBitmap1bit1px(unsigned int bitmap[][32])	//n*32 pixel at a time
{
	//00000000 00000000 00000000 00000000 00000RGB
	unsigned int i, x, y,Rpin,Gpin,Bpin;
	int Rport,Gport,Bport;

	for(y=0;y<32;y++)
	{
		if(y<16)
		{
			ClearPin(R1Port, R1Pin);
			ClearPin(G1Port, G1Pin);
			ClearPin(B1Port, B1Pin);
			Rport=R0Port;
			Gport=G0Port;
			Bport=B0Port;
			Rpin=R0Pin;
			Gpin=G0Pin;
			Bpin=B0Pin;
		}else
		{
			ClearPin(R0Port, R0Pin);
			ClearPin(G0Port, G0Pin);
			ClearPin(B0Port, B0Pin);
			Rport=R1Port;
			Gport=G1Port;
			Bport=B1Port;
			Rpin=R1Pin;
			Gpin=G1Pin;
			Bpin=B1Pin;
		}
		__asm{ NOP }
		
		for(x=0;x<LedMatrixWidth;x++)
		{
			for(i=0;i<LedMatrixWidth;i++)
			{
				if(i==x)
				{
					if(bitmap[x][y] & 1){ SetPin(Bport, Bpin); }else{ ClearPin(Bport, Bpin); }
					if(bitmap[x][y] & 2){ SetPin(Gport, Gpin); }else{ ClearPin(Gport, Gpin); }
					if(bitmap[x][y] & 4){ SetPin(Rport, Rpin); }else{ ClearPin(Rport, Rpin); }
				}else
				{
					ClearPin(Bport, Bpin);
					ClearPin(Gport, Gpin);
					ClearPin(Rport, Rpin);
				}
				waitsys(1);
				
				SetPin(CLKPort, CLKPin);	//clock high
				__asm{ NOP }
				ClearPin(CLKPort, CLKPin);	//clock low
				__asm{ NOP }
			}
			
			//select the row
			SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
			__asm{ NOP }
			if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
			if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
			if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
			if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
			__asm{ NOP }
			SetPin(STBPort, STBPin);	//latch high
			__asm{ NOP }
			ClearPin(STBPort, STBPin);	//latch low
			__asm{ NOP }
			ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			__asm{ NOP }
		}
	}
	waitsys(30);
	SetPin(OEPort,OEPin);	//make the last pixel not remain on for the length of all the above code
	__asm{ NOP }
}

void DispBitmap1bit1Line(unsigned int bitmap[][32])	//1 line at a time
{
	//00000000 00000000 00000000 00000000 00000RGB
	unsigned int x, y,Rpin,Gpin,Bpin;
	int Rport,Gport,Bport;

