bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
	for(y=0;y<32;y++)
	{
		if(y<16)
		{
			ClearPin(R1Port, R1Pin);
			ClearPin(G1Port, G1Pin);
			ClearPin(B1Port, B1Pin);
			Rport=R0Port;
			Gport=G0Port;
			Bport=B0Port;
			Rpin=R0Pin;
			Gpin=G0Pin;
			Bpin=B0Pin;
		}else
		{
			ClearPin(R0Port, R0Pin);
			ClearPin(G0Port, G0Pin);
			ClearPin(B0Port, B0Pin);
			Rport=R1Port;
			Gport=G1Port;
			Bport=B1Port;
			Rpin=R1Pin;
			Gpin=G1Pin;
			Bpin=B1Pin;
		}
		__asm{ NOP }
		
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y] & 1){ SetPin(Bport, Bpin); }else{ ClearPin(Bport, Bpin); }
			if(bitmap[x][y] & 2){ SetPin(Gport, Gpin); }else{ ClearPin(Gport, Gpin); }
			if(bitmap[x][y] & 4){ SetPin(Rport, Rpin); }else{ ClearPin(Rport, Rpin); }
			waitsys(1);
				
			SetPin(CLKPort, CLKPin);	//clock high
			__asm{ NOP }
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
		}
		
		//select the row
		SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
		__asm{ NOP }
		if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		SetPin(STBPort, STBPin);	//latch high
		__asm{ NOP }
		ClearPin(STBPort, STBPin);	//latch low
		__asm{ NOP }
		ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
		__asm{ NOP }
	
		waitsys(100);
	}
}

void DispBitmap1bit2Lines(unsigned int bitmap[][32])	//2 lines at a time
{
	//00000000 00000000 00000000 00000000 00000RGB
	unsigned int x, y, y2;

	for(y=0;y<16;y++)
	{
		y2=y+16;
		
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y] & 1){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
			if(bitmap[x][y] & 2){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
			if(bitmap[x][y] & 4){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
			
			if(bitmap[x][y2] & 1){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
			if(bitmap[x][y2] & 2){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
			if(bitmap[x][y2] & 4){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
			__asm{ NOP }
				
			SetPin(CLKPort, CLKPin);	//clock high
			__asm{ NOP }
			ClearPin(CLKPort, CLKPin);	//clock low
			__asm{ NOP }
		}
		
		//select the row
		SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
		__asm{ NOP }
		if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
		if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
		if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
		if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
		__asm{ NOP }
		SetPin(STBPort, STBPin);	//latch high
		__asm{ NOP }
		ClearPin(STBPort, STBPin);	//latch low
		__asm{ NOP }
		ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
		__asm{ NOP }
	
		waitsys(100);
	}
}


void DispBitmap4bit(unsigned int bitmap[][32])	//	//3 4-bit values 00000000 00000000 0000RRRR GGGG BBBB. 2 lines at a time with 4 bit pwm
{
	unsigned int x, y, y2, i;
	for(i=0;i<16;i++)	//display the frame 16 times to generate software PWM
	{
		if (i != 15 ) {
			for(y=0;y<16;y++)
			{
				y2=y+16;
				
				for(x=0;x<LedMatrixWidth;x++)
				{
					if(i < (bitmap[x][y] & 0xF)){ SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
					if(i < ((bitmap[x][y]>>4) & 0xF)){ SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
					if(i < ((bitmap[x][y]>>8) & 0xF)){ SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
					
					if(i < (bitmap[x][y2] & 0xF)){ SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
					if(i < ((bitmap[x][y2]>>4) & 0xF)){ SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
					if(i < ((bitmap[x][y2]>>8) & 0xF)){ SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
						
					SetPin(CLKPort, CLKPin);	//clock high
					__asm{ NOP }
					ClearPin(CLKPort, CLKPin);	//clock low
				}
				
				//select the row
				SetPin(OEPort,OEPin);	//active low. turn off the leds while changing the active row	such that the current pixel(s) are not shifted down
				__asm{ NOP }
				if(y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
				if(y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
				if(y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
				if(y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
				__asm{ NOP }
				SetPin(STBPort, STBPin);	//latch high
				__asm{ NOP }
				ClearPin(STBPort, STBPin);	//latch low
				__asm{ NOP }
				ClearPin(OEPort,OEPin);	//active low. leds are ready for display, turn on
			}
		} else SetPin(OEPort,OEPin);
	}
}


// 00000000 RRRRRRRR GGGGGGGG BBBBBBBB. 64 pixel at a time using 8 bit weighted binary
void DispBitmap8bit(unsigned int bitmap[][32])
{
    unsigned int x, y, y2, i,b;
	int d1,d2;
    
	for(i=0;i<8;i++)
	{
		  b = 1<<i;
			for(y=0;y<16;y++)
			{
				y2=y+16;
		
				for(x=0;x<LedMatrixWidth;x++)
				{
  				ClearPin(CLKPort, CLKPin);  // clock low
					__asm{ NOP }
	
					d1 = bitmap[x][y];
					if (b & d1)        { SetPin(B0Port, B0Pin); }else{ ClearPin(B0Port, B0Pin); }
					if (b & (d1>>8))   { SetPin(G0Port, G0Pin); }else{ ClearPin(G0Port, G0Pin); }
					if (b & (d1>>16))  { SetPin(R0Port, R0Pin); }else{ ClearPin(R0Port, R0Pin); }
					
   				d2 = bitmap[x][y2];
					if (b & d2)       { SetPin(B1Port, B1Pin); }else{ ClearPin(B1Port, B1Pin); }
					if (b & (d2>>8))  { SetPin(G1Port, G1Pin); }else{ ClearPin(G1Port, G1Pin); }
					if (b & (d2>>16)) { SetPin(R1Port, R1Pin); }else{ ClearPin(R1Port, R1Pin); }
					__asm{ NOP }
					__asm{ NOP }
						
					SetPin(CLKPort, CLKPin);    // clock high
					__asm{ NOP }
				}
				ClearPin(CLKPort, CLKPin);  // clock low
				__asm{ NOP }
				
				// Select the row
				if (y & 1){ SetPin(RowSelectAPort, RowSelectAPin); }else{ ClearPin(RowSelectAPort, RowSelectAPin); }
				if (y & 2){ SetPin(RowSelectBPort, RowSelectBPin); }else{ ClearPin(RowSelectBPort, RowSelectBPin); }
				if (y & 4){ SetPin(RowSelectCPort, RowSelectCPin); }else{ ClearPin(RowSelectCPort, RowSelectCPin); }
				if (y & 8){ SetPin(RowSelectDPort, RowSelectDPin); }else{ ClearPin(RowSelectDPort, RowSelectDPin); }
				__asm{ NOP }

				SetPin(STBPort, STBPin);   // latch high
				__asm{ NOP }
				ClearPin(STBPort, STBPin); // latch low
				__asm{ NOP }
				
				ClearPin(OEPort,OEPin);	// Enable output
				waitsys(b<<1);
				SetPin(OEPort,OEPin);
				__asm{ NOP }
			}
	}
}


void DisplayBitmap(unsigned int bitmap[][32], unsigned int mode)
{
	switch(mode)
	{
		case DisplayMode1bit1px:
			DispBitmap1bit1px(bitmap);
		break;
		case DisplayMode1bit1Line:
			DispBitmap1bit1Line(bitmap);
		break;
		case DisplayMode1bit2Lines:
			DispBitmap1bit2Lines(bitmap);
		break;
		case DisplayMode4bit:
			DispBitmap4bit(bitmap);
		break;
		case DisplayMode8bit:
			DispBitmap8bit(bitmap);
		break;
	}	
}

void DisplayBitmapDuration(unsigned int bitmap[][32], unsigned int durationMS, unsigned int mode)
{
	durationMS*=10;
	ResetTimer14();
	while(ReadTimer14()<durationMS)
	{
		DisplayBitmap(bitmap,mode);
	}	
}

void BitmapTest(unsigned int mode)	//run this in a loop
{
	unsigned int x,y,c,r,g,b,yy;
	unsigned int bitmap[LedMatrixWidth][32]={0};
	
