bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
	if(mode<=DisplayMode1bit2Lines)	//1 bit test pattern (checker board)
	{
		for(y=0;y<31;y+=4)
		{
			for(x=0;x<LedMatrixWidth-1;x+=4)
			{
				c=((x>>2)+(y>>2)) & 7;
				for(yy=0;yy<4;yy++)
				{
					bitmap[x][y+yy]=c;
					bitmap[x+1][y+yy]=c;
					bitmap[x+2][y+yy]=c;
					bitmap[x+3][y+yy]=c;
				}
			}
		}
	}else
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(mode==DisplayMode4bit)	//4 bit gradient bars
			{
				r=(x*15)/LedMatrixWidth;
				g=r<<4;
				b=r<<8;
			}else	//8 bit gradient bars
			{
				r=(x*255)/LedMatrixWidth;
				g=r<<8;
				b=r<<16;
			}
			
			//black
			bitmap[x][0]=0;
			bitmap[x][1]=0;
			bitmap[x][2]=0;
			bitmap[x][3]=0;
			
			//r
			bitmap[x][4]=r;
			bitmap[x][5]=r;
			bitmap[x][6]=r;
			bitmap[x][7]=r;
			
			//rg
			bitmap[x][8]=r | g;
			bitmap[x][9]=r | g;
			bitmap[x][10]=r | g;
			bitmap[x][11]=r | g;
			
			//g
			bitmap[x][12]=g;
			bitmap[x][13]=g;
			bitmap[x][14]=g;
			bitmap[x][15]=g;
			
			//gb
			bitmap[x][16]=g | b;
			bitmap[x][17]=g | b;
			bitmap[x][18]=g | b;
			bitmap[x][19]=g | b;
			
			//b
			bitmap[x][20]=b;
			bitmap[x][21]=b;
			bitmap[x][22]=b;
			bitmap[x][23]=b;
			
			//br
			bitmap[x][24]=b | r;
			bitmap[x][25]=b | r;
			bitmap[x][26]=b | r;
			bitmap[x][27]=b | r;
			
			bitmap[x][28]=r | g | b;
			bitmap[x][29]=r | g | b;
			bitmap[x][30]=r | g | b;
			bitmap[x][31]=r | g | b;
		}
	}
	
	DisplayBitmap(bitmap,mode);
}

void BmpClear(unsigned int bitmap[][32], unsigned int colour)
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			bitmap[x][y]=colour;
		}
	}
}

void BmpCopy(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=sourcebitmap[x][y];
		}
	}
}

void BmpSetPixel(unsigned int bitmap[][32], int x, int y, unsigned int colour)	//1 or 4 bit format
{
	if((x>=0) && (x<=(LedMatrixWidth-1)) && (y>=0) && (y<=(LedMatrixHeight-1)))
	{
		bitmap[x][y]=colour;
	}
}

void BmpMix(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=sourcebitmap[x][y] | destbitmap[x][y];
		}
	}
}

void BmpMultiply(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32])
{
	unsigned int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			destbitmap[x][y]=(sourcebitmap[x][y] * destbitmap[x][y])>>5;
		}
	}
}

unsigned int BmpReadPixel(unsigned int bitmap[][32], int x, int y)
{
	if((x>=0) && (x<=(LedMatrixWidth-1)) && (y>=0) && (y<=31))
	{
		return bitmap[x][y];
	}else
	{
		return 0;
	}
}

void BmpMixPixel(unsigned int bitmap[][32], int x, int y, unsigned int colour)
{
	BmpSetPixel(bitmap,x,y,BmpReadPixel(bitmap,x,y) | colour);
}

void BmpReplaceColourWithColour(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int ReplacementColour)
{
	int x, y;

	for(y=0;y<8;y++)
	{
		for(x=0;x<8;x++)
		{
			if(BmpReadPixel(bitmap,x,y)==ReplacementColour){ BmpSetPixel(bitmap,x,y,ColourToReplace); }
		}
	}
}

void BmpReplaceColourWithBmp(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int backgroundbitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y]==ColourToReplace){ bitmap[x][y]=backgroundbitmap[x][y]; }
		}
	}
}

void BmpReplaceColourWithBmpIntoBmp(unsigned int bitmap[][32], unsigned int ColourToReplace, unsigned int backgroundbitmap[][32], unsigned int destbitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			if(bitmap[x][y]==ColourToReplace){ destbitmap[x][y]=backgroundbitmap[x][y]; }else{ destbitmap[x][y]=bitmap[x][y]; }
		}
	}
}

void BmpFadeDown(unsigned int bitmap[][32], unsigned int delayMS)
{	
	int x, y, r, g, b;
	unsigned int changed;

	do
	{
		changed=0;
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				b=bitmap[x][y] & 0xF;
				g=((bitmap[x][y])>>4) & 0xF;
				r=((bitmap[x][y])>>8) & 0xF;
				if(r!=0){ r-=1; changed=1; }
				if(g!=0){ g-=1; changed=1;  }
				if(b!=0){ b-=1; changed=1;  }
				
				bitmap[x][y]=(r<<8) | (g<<4) | b;
			}
		}
		DisplayBitmapDuration(bitmap, delayMS, DisplayMode8bit);
	}while(changed==1);
}

void BmpFadeUp(unsigned int bitmap[][32], unsigned int delayMS)
{	
	int x, y, r1, g1, b1, r2, g2, b2;
	unsigned int changed;
	unsigned int bmp[32][32]={0};

	do
	{
		changed=0;
		for(y=0;y<32;y++)
		{
			for(x=0;x<LedMatrixWidth;x++)
			{
				b1=bitmap[x][y] & 0xF;
				g1=((bitmap[x][y])>>4) & 0xF;
				r1=((bitmap[x][y])>>8) & 0xF;
				
				b2=bmp[x][y] & 0xF;
				g2=((bmp[x][y])>>4) & 0xF;
				r2=((bmp[x][y])>>8) & 0xF;
				
				if(r2!=r1){ r2+=1; changed=1; }
				if(g2!=g1){ g2+=1; changed=1;  }
				if(b2!=b1){ b2+=1; changed=1;  }
				
				bmp[x][y]=(r2<<8) | (g2<<4) | b2;
			}
		}
		DisplayBitmapDuration(bmp, delayMS, DisplayMode8bit);
	}while(changed==1);
}

void BmpLine(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int x, y, xdelta, ydelta, width, height, i, count;
	
	if(y1==y2)
	{
		if((y1>=0) && (y1<=31))
		{
			if(x1>x2){ x=x2; x2=x1; x1=x; }
			for(x=x1;x<=x2;x++)
			{
				BmpSetPixel(bitmap,x,y1,colour);
			}
		}
	  return;
	}

	if(x1==x2)
	{
		if((x1>=0) && (x1<=(LedMatrixWidth-1)))
		{
			if(y1>y2){ y=y2; y2=y1; y1=y; }
			for(y=y1;y<=y2;y++)
			{
				BmpSetPixel(bitmap,x1,y,colour);
			}
		}
	  return;
	}
	
	width = x2 - x1;
	height = y2 - y1;
	
	count = max(iabs(width),iabs(height));

	xdelta = (width << 16) / count;
	ydelta = (height << 16) / count;

	x = x1 << 16;
	y = y1 << 16;

	for (i = 0;i <= count;i++)
	{
		BmpSetPixel(bitmap,x>>16,y>>16,colour);
		x += xdelta;
		y += ydelta;
	}	
}

void BmpRectangle(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int tmp;
	int x;
	int y;
	
	if(x1>x2){ tmp=x2; x2=x1; x1=tmp; }
	if(y1>y2){ tmp=y2; y2=y1; y1=tmp; }

	for(x=x1;x<=x2;x++)
	{
		BmpSetPixel(bitmap,x,y1,colour);
		BmpSetPixel(bitmap,x,y2,colour);
	}
	for(y=y1;y<=y2;y++)
	{
		BmpSetPixel(bitmap,x1,y,colour);
		BmpSetPixel(bitmap,x2,y,colour);
	}
}

void BmpRectangleFilled(unsigned int bitmap[][32], int x1, int y1, int x2, int y2,  unsigned int colour)
{
	int tmp;
	int x;
	int y;
	
