bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
	if(x1>x2){ tmp=x2; x2=x1; x1=tmp; }
	if(y1>y2){ tmp=y2; y2=y1; y1=tmp; }

	for(x=x1;x<=x2;x++)
	{
		for(y=y1;y<=y2;y++)
		{
			BmpSetPixel(bitmap,x,y,colour);
		}
	}
}

void BmpCircle(unsigned int bitmap[][32], int x0, int y0, int radius, unsigned int colour)
{
	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x = 0;
	int y = radius;
	
	BmpSetPixel(bitmap,x0, y0 + radius,colour);
	BmpSetPixel(bitmap,x0, y0 - radius,colour);
	BmpSetPixel(bitmap,x0 + radius, y0,colour);
	BmpSetPixel(bitmap,x0 - radius, y0,colour);
	
	while(x < y)
	{
		if(f >= 0) 
		{
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		    
		BmpSetPixel(bitmap,x0 + x, y0 + y,colour);	//segment 4
		BmpSetPixel(bitmap,x0 - x, y0 + y,colour);	//segment 5
		BmpSetPixel(bitmap,x0 + x, y0 - y,colour);	//segment 1
		BmpSetPixel(bitmap,x0 - x, y0 - y,colour);	//segment 8
		BmpSetPixel(bitmap,x0 + y, y0 + x,colour);	//segment 3
		BmpSetPixel(bitmap,x0 - y, y0 + x,colour);	//segment 6
		BmpSetPixel(bitmap,x0 + y, y0 - x,colour);	//segment 2
		BmpSetPixel(bitmap,x0 - y, y0 - x,colour);	//segment 7
	}
}

void BmpCircleFilled(unsigned int bitmap[][32], int x0, int y0, int radius, unsigned int colour)
{
	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x = 0;
	int y = radius;
	
	BmpLine(bitmap, x0 - radius,y0,x0 + radius+1,y0,colour);
	
	while(x < y)
	{
		if(f >= 0) 
		{
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		    
		BmpLine(bitmap, x0 + x, y0 - y,x0 - x, y0 - y,colour);	//segment 1 to 8
		BmpLine(bitmap, x0 + y, y0 - x,x0 - y, y0 - x,colour);	//segment 2 to 7
		BmpLine(bitmap, x0 + y, y0 + x,x0 - y, y0 + x,colour);	//segment 3 to 6
		BmpLine(bitmap, x0 + x, y0 + y,x0 - x, y0 + y,colour);	//segment 4 to 5
	}
}

void BmpInvertColours(unsigned int bitmap[][32])
{
	int x, y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			bitmap[x][y] ^= 0xFFF;
		}
	}
}

void BmpShiftLeft(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(y=0;y<32;y++)
	{
		for(x=0;x<LedMatrixWidth;x++)
		{
			BmpSetPixel(bitmap,x,y,BmpReadPixel(bitmap,x+shift,y));
		}
	}
}

void BmpShiftRight(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(y=0;y<32;y++)
	{
		for(x=(LedMatrixWidth-1);x>=0;x--)
		{
			BmpSetPixel(bitmap,x,y,BmpReadPixel(bitmap,x-shift,y));
		}
	}
}

void BmpShiftUp(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(x=0;x<LedMatrixWidth;x++)
	{
		for(y=0;y<32;y++)
		{
			BmpSetPixel(bitmap,x,y,BmpReadPixel(bitmap,x,y+shift));
		}
	}
}

void BmpShiftDown(unsigned int bitmap[][32], int shift)
{
	int x;
	int y;

	for(x=0;x<LedMatrixWidth;x++)
	{
		for(y=31;y>=0;y--)
		{
			BmpSetPixel(bitmap,x,y,BmpReadPixel(bitmap,x,y-shift));
		}
	}
}

void BmpRotate(unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], double angle, double midx, double midy)
{
  double x;
	double y;
	double xold;
	double yold;
	double xnew;
	double ynew;
	double s,c,yoldS,yoldC;
	
	s=sin((angle * 3.14159) / 180.0);
	c=cos((angle * 3.14159) / 180.0);

	for(y=0;y<32;y++)
	{
	  yold = y - midy;
		yoldS=yold * s;
		yoldC=yold * c;
		for(x=0;x<LedMatrixWidth;x++)
		{
			xold = x - midx;
			xnew = (xold * c) - yoldS;
			ynew = (xold * s) + yoldC;
			BmpSetPixel(destbitmap,rint(xnew + midx),rint(ynew + midy),BmpReadPixel(sourcebitmap,x,y));
	  }
	}
}

unsigned int BmpCharacter(unsigned int bitmap[][32], char character, int x1, int y1, unsigned int font, unsigned int colour)
{
	int x;
	int y;
	int bytenum;

	if(font==LedFontVariableWidth)
	{
		x=0;
		for(bytenum=pxldata[character-' '];bytenum<(pxldata[character-' ']+pxldata[95+(character-' ')]);bytenum++)
		{
			for(y=0;y<8;y++)	//add byte
			{
				if(((pxldata[bytenum]>>y) & 1)==1){ BmpSetPixel(bitmap,x+x1,y+y1,colour); }
			}
			x+=1;
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((LEDascii_7x11[character-0x20][x]>>y) & 1)
				{
					BmpSetPixel(bitmap,x+x1,y+y1-5,colour);
				}
			}
		}
	}
	
	return x1+x+1;
}

unsigned int BmpGetCharacterLength(char character)
{
	return pxldata[95+(character-' ')];
}

void BmpShiftInCharacter(unsigned int bitmap[][32], char character, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int x, y;
	unsigned int bytenum, mS;
	
	mS=1000/fps;

	if(font==LedFontVariableWidth)
	{
		for(bytenum=pxldata[character-' '];bytenum<(pxldata[character-' ']+pxldata[95+(character-' ')]);bytenum++)
		{
			ResetTimer14();
			for(y=0;y<8;y++)	//add byte
			{
				if(((pxldata[bytenum]>>y) & 1)==1){ BmpSetPixel(bitmap,xRight,yTop+y,colour); }
			}
			DisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
			BmpShiftLeft(bitmap,1);	//scroll
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((LEDascii_7x11[character-0x20][x]>>y) & 1)
				{
					BmpSetPixel(bitmap,xRight,yTop+y-5,colour);
				}
			}
			DisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
			BmpShiftLeft(bitmap,1);	//scroll
		}
	}

	DisplayBitmapDuration(bitmap, mS, DisplayMode);		//display frame
	BmpShiftLeft(bitmap,1);	//extra 1px space after the character
}

void BmpShiftInCharacterWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], char character, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int x, y;
	unsigned int bytenum, mS;
	unsigned int outputbitmap[32][32];
	
	mS=1000/fps;

	if(font==LedFontVariableWidth)
	{
		for(bytenum=pxldata[character-' '];bytenum<(pxldata[character-' ']+pxldata[95+(character-' ')]);bytenum++)
		{
			ResetTimer14();
			for(y=0;y<8;y++)	//add byte
			{
				if(((pxldata[bytenum]>>y) & 1)==1){ BmpSetPixel(bitmap,xRight,yTop+y,colour); }
			}
			
			BmpReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
			DisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
			BmpShiftLeft(bitmap,1);	//scroll
		}
	}
	
	if(font==LedFont7x11)
	{
		for(x=0;x<7;x++)
		{
			for(y=5;y<16;y++)
			{
				if((LEDascii_7x11[character-0x20][x]>>y) & 1)
				{
					BmpSetPixel(bitmap,xRight,yTop+y-5,colour);
				}
			}
			BmpReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
			DisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
			BmpShiftLeft(bitmap,1);	//scroll
		}
	}

	BmpReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
	DisplayBitmapDuration(outputbitmap, mS, DisplayMode);		//display frame
	BmpShiftLeft(bitmap,1);	//extra 1px space after the character
}

void BmpScrollText(unsigned int bitmap[][32], char characters[200], int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int i=0;

	while(characters[i]!=0)
	{
		BmpShiftInCharacter(bitmap, characters[i], xRight, yTop, fps, colour, font, DisplayMode);
		i++;
	}
}

void BmpScrollTextWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], char characters[200], int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int i=0;

	while(characters[i]!=0)
	{
		BmpShiftInCharacterWithBG(bitmap, bitmapBG, characters[i], xRight, yTop, fps, colour, font, DisplayMode);
		i++;
	}
}

void BmpScrollValue(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ BmpShiftInCharacter(bitmap, digitval+'0', xRight, yTop, fps, colour, font, DisplayMode); }
		unit /= 10;
	}
}

