bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
void BmpScrollValueWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int font, unsigned int DisplayMode)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ BmpShiftInCharacterWithBG(bitmap, bitmapBG, digitval+'0', xRight, yTop, fps, colour, font, DisplayMode); }
		unit /= 10;
	}
}

void BmpSevSegDigit(unsigned int bitmap[][32], unsigned int val, int xLeft, int yTop, unsigned int colour)
{
	int x;
	int y;
	unsigned int segments;
	unsigned int digits[10]={0x3F, 0x06, 0x5B, 0x4F, 0x66, 0x6D, 0x7D, 0x07, 0x7F, 0x6F};
	
	segments=digits[val];
	
	if(segments & 1)		//seg A
	{
		for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop,colour); }
	}

	if(segments & 2)		//seg B
	{
		for(y=yTop;y<=(yTop+2);y++){ BmpSetPixel(bitmap,xLeft+2,y,colour); }
	}

	if(segments & 4)		//seg C
	{
		for(y=yTop+2;y<=(yTop+4);y++){ BmpSetPixel(bitmap,xLeft+2,y,colour); }
	}

	if(segments & 8)		//seg D
	{
		for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop+4,colour); }
	}

	if(segments & 16)		//seg E
	{
		for(y=yTop+2;y<=(yTop+4);y++){ BmpSetPixel(bitmap,xLeft,y,colour); }
	}

	if(segments & 32)		//seg F
	{
		for(y=yTop;y<=(yTop+2);y++){ BmpSetPixel(bitmap,xLeft,y,colour); }
	}

	if(segments & 64)		//seg G
	{
		for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop+2,colour); }
	}
}

unsigned int BmpSevSegSegMultiDigits(unsigned int bitmap[][32], unsigned int val, int xLeft, int yTop, unsigned int ForceDigits, unsigned int colour)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;
	unsigned int x1=0;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1) || (digit<=ForceDigits)){ print=1; }
		if(print==1){ BmpSevSegDigit(bitmap, digitval, xLeft+x1, yTop, colour); x1+=4; }
		unit /= 10;
	}
	
	return xLeft+x1;
}

void BmpSevSegAMPM(unsigned int bitmap[][32], unsigned int AMPM, int xLeft, int yTop, unsigned int DispM, unsigned int colour)
{
	int x;
	int y;
	unsigned int digits[3]={127^8, 2 | 4 | 16 | 32, 127^(4 | 8)};	//A M P
	char strAMPM[2];
	unsigned int i;
	
	if(AMPM==0){ strAMPM[0]=0; }else{ strAMPM[0]=2; }
	strAMPM[1]=1;
	
	for(i=0;i<2;i++)
	{
		if(digits[strAMPM[i]] & 1)		//seg A
		{
			for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop,colour); }
		}

		if(digits[strAMPM[i]] & 2)		//seg B
		{
			for(y=yTop;y<=(yTop+2);y++){ BmpSetPixel(bitmap,xLeft+2,y,colour); }
		}

		if(digits[strAMPM[i]] & 4)		//seg C
		{
			for(y=yTop+2;y<=(yTop+4);y++){ BmpSetPixel(bitmap,xLeft+2,y,colour); }
		}

		if(digits[strAMPM[i]] & 8)		//seg D
		{
			for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop+4,colour); }
		}

		if(digits[strAMPM[i]] & 16)		//seg E
		{
			for(y=yTop+2;y<=(yTop+4);y++){ BmpSetPixel(bitmap,xLeft,y,colour); }
		}

		if(digits[strAMPM[i]] & 32)		//seg F
		{
			for(y=yTop;y<=(yTop+2);y++){ BmpSetPixel(bitmap,xLeft,y,colour); }
		}

		if(digits[strAMPM[i]] & 64)		//seg G
		{
			for(x=xLeft;x<=(xLeft+2);x++){ BmpSetPixel(bitmap,x,yTop+2,colour); }
		}
		
		if(DispM==0){ break; }
		
		if(i==1){ BmpSetPixel(bitmap,xLeft+1,yTop+1,colour); } //if M, add the middle dot
		
		xLeft+=4;
	}
}

void BmpShiftInDigitSevSeg(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode)
{
	unsigned int y;
	unsigned int bytenum;
	
	for(bytenum=val*3;bytenum<=((val*3)+2);bytenum++)
	{
		ResetTimer14();
		for(y=0;y<5;y++)	//add byte
		{
			if(((sevsegpxldata[bytenum]>>y) & 1)==1){ BmpSetPixel(bitmap,xRight,y+yTop,colour); }
		}
		DisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
		BmpShiftLeft(bitmap,1);	//scroll
	}

	ResetTimer14();
	DisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
	BmpShiftLeft(bitmap,1);	//extra 1px space after the character
}

void BmpShiftInDigitSevSegWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode)
{
	unsigned int y;
	unsigned int bytenum;
	unsigned int outputbitmap[32][32];
	
	for(bytenum=val*3;bytenum<=((val*3)+2);bytenum++)
	{
		ResetTimer14();
		for(y=0;y<5;y++)	//add byte
		{
			if(((sevsegpxldata[bytenum]>>y) & 1)==1){ BmpSetPixel(bitmap,xRight,y+yTop,colour); }
		}
		BmpReplaceColourWithBmpIntoBmp(bitmap,0,bitmapBG,outputbitmap);
		DisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
		BmpShiftLeft(bitmap,1);	//scroll
	}

	ResetTimer14();
	DisplayBitmapDuration(bitmap, 1000/fps, DisplayMode);		//display frame
	BmpShiftLeft(bitmap,1);	//extra 1px space after the character
}

void BmpScrollValueSevSeg(unsigned int bitmap[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ BmpShiftInDigitSevSeg(bitmap, digitval, xRight, yTop, fps, colour, DisplayMode); }
		unit /= 10;
	}
}

void BmpScrollValueSevSegWithBG(unsigned int bitmap[][32], unsigned int bitmapBG[][32], unsigned int val, int xRight, int yTop, unsigned int fps, unsigned int colour, unsigned int DisplayMode)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;
	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ BmpShiftInDigitSevSegWithBG(bitmap, bitmapBG, digitval, xRight, yTop, fps, colour, DisplayMode); }
		unit /= 10;
	}
}

void DrawSegmentLarge(unsigned int bitmap[][32], unsigned int x, unsigned int y, unsigned int length, unsigned int width, unsigned int type, unsigned int colour)
{
	int i;
	
	switch(type)
	{
		case 0:	//left
			for(i=0;i<width;i++)
			{
				BmpLine(bitmap, x+i,y+i,x+i,y+(length-1)-i,colour);
			}
		break;
		case 1:	//right
			for(i=0;i<width;i++)
			{
				BmpLine(bitmap, x+((width-1)-i),y+i,x+((width-1)-i),y+(length-1)-i,colour);
			}
		break;
		case 2:	//top
			for(i=0;i<width;i++)
			{
				BmpLine(bitmap, x+i,y+i,x+(length-1)-i,y+i,colour);
			}
		break;
		case 3:	//bottom
			for(i=0;i<width;i++)
			{
				BmpLine(bitmap, x+((width-1)-i),y+i,x+(length-1)-((width-1)-i),y+i,colour);
			}
		break;
		case 4:	//middle
			width>>=1;
			for(i=0;i<width;i++)
			{
				BmpLine(bitmap, x+((width-1)-i),y+i,x+(length-1)-((width-1)-i),y+i,colour);
			}
			y+=width-1;
			for(i=1;i<width;i++)
			{
				BmpLine(bitmap, x+i,y+i,x+(length-1)-i,y+i,colour);
			}
		break;
	}
}


unsigned int SevSegDigitLarge(unsigned int bitmap[][32], unsigned int digit, unsigned int x, unsigned int y, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int length;

	length=(height>>1)-(gap>>1);
	
	switch(digit)
	{
		case 0:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 1:
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 2:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 3:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 4:
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 5:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 6:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 7:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
		break;
		case 8:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x, y+length+(gap<<1), length, thickness, 0, colour);	//left bottom
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
		case 9:
			DrawSegmentLarge(bitmap,x+gap, y, length, thickness, 2, colour);	//top
			DrawSegmentLarge(bitmap,x, y+gap, length, thickness, 0, colour);	//left top
			DrawSegmentLarge(bitmap,x+gap, y+(length<<1)+(gap<<1)+gap-thickness, length, thickness, 3, colour);	//bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+length+(gap<<1), length, thickness, 1, colour);	//right bottom
			DrawSegmentLarge(bitmap,x+length+(gap<<1)-thickness, y+gap, length, thickness, 1, colour);	//right top
			DrawSegmentLarge(bitmap,x+gap, y+length+gap+(gap>>1)-((unsigned int)(thickness*1.5)>>1), length, thickness*1.5, 4, colour);	//middle
		break;
	}

