bjornbaverfjord/STM32F429-Discovery/32x32_RGB_LED.c
	return x+length+(gap<<1)+(length>>2);
}


unsigned int PrintValueSevSegLarge(unsigned int bitmap[][32], unsigned int val, unsigned int xpos, unsigned int ypos, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int unit;
	unsigned int digit;
	unsigned int digitval;
	unsigned int print;

	unit=1000000000;
	print=0;

	for(digit=10;digit>=1;digit--)
	{
		digitval=val/unit;
		val -= digitval*unit;
		if((digitval>0) || (digit==1)){ print=1; }
		if(print==1){ xpos=SevSegDigitLarge(bitmap, digitval, xpos, ypos, height, thickness, gap, colour); }
		unit /= 10;
	}

	return xpos;
}


unsigned int PrintValue2DigitsSevSegLarge(unsigned int bitmap[][32], unsigned int val, unsigned int xpos, unsigned int ypos, unsigned int height, unsigned int thickness, unsigned int gap, unsigned int colour)
{
	unsigned int tens, units;

	tens=val/10;
	units=val-(tens*10);
	xpos=SevSegDigitLarge(bitmap, tens, xpos, ypos, height, thickness, gap, colour);
	xpos=SevSegDigitLarge(bitmap, units, xpos, ypos, height, thickness, gap, colour);

	return xpos;
}

void PrintfNx32LED(unsigned int bitmap[][32], int x1, int y1, unsigned int font, unsigned int colour, const char * format, ... )
{
	char buff[256];
	unsigned int i=0;
	va_list args;
	
	va_start(args,format);
	vsnprintf(buff,256,format,args);
	
  //print the string
	do
	{
		x1=BmpCharacter(bitmap, buff[i], x1, y1, font, colour);
		i+=1;
	}while(buff[i]!=0);
	
	va_end(args);
}

void BmpPlaceBitmap(const unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], unsigned int width, unsigned int height, int xpos, int ypos)
{
	unsigned int x, y;
	
	for(x=0;x<width;x++)
	{
		for(y=0;y<height;y++)
		{
			BmpSetPixel(destbitmap,x+xpos,y+ypos,sourcebitmap[x][y]);
		}
	}
}

void BmpShiftInBitmap(const unsigned int sourcebitmap[][32], unsigned int destbitmap[][32], unsigned int width, unsigned int height, int xRight, int yTop, unsigned int endgap, unsigned int fps, unsigned int DisplayMode)
{
	unsigned int x, y, mS;
	
	mS=1000/fps;
	
	for(x=0;x<width;x++)
	{
		for(y=0;y<height;y++)
		{
			BmpSetPixel(destbitmap,xRight,yTop+y,sourcebitmap[x][y]);
		}
		DisplayBitmapDuration(destbitmap, mS, DisplayMode);		//display frame
		BmpShiftLeft(destbitmap,1);	//scroll
	}

	for(x=0;x<endgap;x++)
	{
		DisplayBitmapDuration(destbitmap, mS, DisplayMode);		//display frame
		BmpShiftLeft(destbitmap,1);
	}
}
